from aiogram import types
from app.keyboards.inline.constructor import create_inline_keyboard
from aiogram.types import CallbackQuery



async def my_bots(call: CallbackQuery):
    await call.message.edit_text("Какие боты интересуют?",
                                 reply_markup=create_inline_keyboard(
                                     buttons=[
                                        ["🔥 Готовые боты(без реф системы)", "ready_bots"],
                                        ["🔥 Боты(с реф системой)", "ready_bots_ref"],
                                        ["🔙 Назад", "back_main"]
                                    ],
                                     schema=[1, 1, 1]).as_markup())

async def ready_bots(call: CallbackQuery):
    text = """🏆 На самом деле у нас есть более 50 готовых чат-ботов для различных компаний.
Однако, чтобы облегчить вам просмотр, мы не размещаем их все здесь. Если вы не нашли подходящего бота для своей компании, пожалуйста, уточните информацию о доступных готовых ботах здесь: @System_SX_100."""
    await call.message.edit_text(text,
                                 reply_markup=create_inline_keyboard([
                                     ["🔙 Назад", "back_my_bots"]
                                     ],
                                        schema=[1]).as_markup())

async def ready_bots_ref(call: CallbackQuery):
    text = """🦾 Это уникальный инструмент для управления трафиком!

🔥 Внутренняя реферальная система позволяет привлекать большие объемы трафика, задействуя вашу аудиторию!
🔥 Система реферальных ссылок гарантирует, что ваша аудитория будет привлечена теми, кто их пригласил!

‼️ Нет необходимости в инвайтинге и спамовых рассылках!

✅ Вся команда работает в одном боте!
✅ Лидер направляет весь трафик!
✅ Распределение клиентов и партнеров жестко привязано к тем, кто их пригласил!

===================
😎 Настройка таких ботов полностью индивидуальна для каждой компании, проекта или команды!

🏆 Это идеальное решение для лидеров и тех, кто стремится им стать!

https://www.youtube.com/watch?v=ZWcoW6oohHk

⚡️ Более подробное описание функционала и возможностей доступно в видео!

😇 Примеры ботов с реферальной системой:

👉 Бесплатная рекламная площадка для сетевиков

👉 Бот с реферальной системой для продуктовой компании

✍️ Для запросов о создании ботов с системой реферральных ссылок, обращайтесь сюда: @System_SX_100"""
    await call.message.edit_text(text,
                                 reply_markup=create_inline_keyboard([
                                     ["🔙 Назад", "back_my_bots"]
                                     ],
                                        schema=[1]).as_markup())